---
kind: property
id: P:Autodesk.Revit.UI.Events.ComboBoxCurrentChangedEventArgs.NewValue
source: html/62d76530-7c07-3c9b-1332-1f983ded454f.htm
---
# Autodesk.Revit.UI.Events.ComboBoxCurrentChangedEventArgs.NewValue Property

The current item for the ComboBox after the change.

## Syntax (C#)
```csharp
public ComboBoxMember NewValue { get; }
```